pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//                      File 'pic18_optimizations.cpp'                       *
//                        Generated by version 2.4.3                         *
//                      june 17th, 2013, at 15h21'47"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_optimizations.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_optimizations.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//                 Routine 'findFirstInstructionFromAddress'                 *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_findFirstInstructionFromAddress (const GALGAS_uint constinArgument_inLineIndex,
                                              const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                              GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument_outFirstInstruction,
                                              GALGAS_uint & outArgument_outNextInstructionLineIndex,
                                              C_Compiler * inCompiler
                                              COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outFirstInstruction.drop () ; // Release 'out' argument
  outArgument_outNextInstructionLineIndex.drop () ; // Release 'out' argument
  //-------- @assignmentInstructionForGeneration
  outArgument_outNextInstructionLineIndex = constinArgument_inLineIndex ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outFirstInstruction = GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (36)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_found = GALGAS_bool (false) ;
  //-------- @loopInstructionForGeneration
  if (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (38)).isValid ()) {
    PMUInt32 variant_1487 = constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (38)).uintValue () ;
    bool loop_1487 = true ;
    while (loop_1487) {
      loop_1487 = GALGAS_bool (kIsStrictInf, outArgument_outNextInstructionLineIndex.objectCompare (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (39)))).operator_and (var_found.operator_not (SOURCE_FILE_AT_LINE (39)) COMMA_SOURCE_FILE_AT_LINE (39)).isValid () ;
      if (loop_1487) {
        loop_1487 = GALGAS_bool (kIsStrictInf, outArgument_outNextInstructionLineIndex.objectCompare (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (39)))).operator_and (var_found.operator_not (SOURCE_FILE_AT_LINE (39)) COMMA_SOURCE_FILE_AT_LINE (39)).boolValue () ;
      }
      if (loop_1487 && (0 == variant_1487)) {
        loop_1487 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (38)) ;
      }
      if (loop_1487) {
        variant_1487 -- ;
        //-------- @structuredCastInstructionForGeneration
        if (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (outArgument_outNextInstructionLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (41)).isValid ()) {
          if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *> (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (outArgument_outNextInstructionLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (41)).ptr ())) {
            GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction cast_1761_instr ((cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (outArgument_outNextInstructionLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (41)).ptr ()) ;
            //-------- @assignmentInstructionForGeneration
            outArgument_outFirstInstruction = cast_1761_instr ;
            //-------- @assignmentInstructionForGeneration
            var_found = GALGAS_bool (true) ;
          }else if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *> (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (outArgument_outNextInstructionLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (41)).ptr ())) {
            //-------- @assignmentInstructionForGeneration
            var_found = GALGAS_bool (true) ;
          }else{
            //-------- @incrementInstructionForGeneration
            outArgument_outNextInstructionLineIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (48)) ;
          }
        }
      }
    }
  }
  //-------- @incrementInstructionForGeneration
  outArgument_outNextInstructionLineIndex.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (51)) ;
}


//---------------------------------------------------------------------------*
//                                                                           *
//             Routine 'findFirstInstructionOrLabelFromAddress'              *
//                                                                           *
//---------------------------------------------------------------------------*

