pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
void routine_findFirstInstructionOrLabelFromAddress (const GALGAS_uint constinArgument_inLineIndex,
                                                     const GALGAS_pic_31__38__5F_intermediate_5F_instructionList constinArgument_inGeneratedInstructionList,
                                                     GALGAS_pic_31__38__5F_intermediate_5F_instruction & outArgument_outFirstInstruction,
                                                     GALGAS_stringset & outArgument_outReachedLabelSet,
                                                     C_Compiler * inCompiler
                                                     COMMA_UNUSED_LOCATION_ARGS) {
  outArgument_outFirstInstruction.drop () ; // Release 'out' argument
  outArgument_outReachedLabelSet.drop () ; // Release 'out' argument
  //-------- @assignmentInstructionForGeneration
  outArgument_outReachedLabelSet = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (62)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_currentAddress = constinArgument_inLineIndex ;
  //-------- @assignmentInstructionForGeneration
  outArgument_outFirstInstruction = GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (66)) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_found = GALGAS_bool (false) ;
  //-------- @loopInstructionForGeneration
  if (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (68)).isValid ()) {
    PMUInt32 variant_2588 = constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (68)).uintValue () ;
    bool loop_2588 = true ;
    while (loop_2588) {
      loop_2588 = GALGAS_bool (kIsStrictInf, var_currentAddress.objectCompare (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (69)))).operator_and (var_found.operator_not (SOURCE_FILE_AT_LINE (69)) COMMA_SOURCE_FILE_AT_LINE (69)).isValid () ;
      if (loop_2588) {
        loop_2588 = GALGAS_bool (kIsStrictInf, var_currentAddress.objectCompare (constinArgument_inGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (69)))).operator_and (var_found.operator_not (SOURCE_FILE_AT_LINE (69)) COMMA_SOURCE_FILE_AT_LINE (69)).boolValue () ;
      }
      if (loop_2588 && (0 == variant_2588)) {
        loop_2588 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (68)) ;
      }
      if (loop_2588) {
        variant_2588 -- ;
        //-------- @structuredCastInstructionForGeneration
        if (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).isValid ()) {
          if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *> (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).ptr ())) {
            GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction cast_2836_instr ((cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).ptr ()) ;
            //-------- @assignmentInstructionForGeneration
            outArgument_outFirstInstruction = cast_2836_instr ;
            //-------- @assignmentInstructionForGeneration
            var_found = GALGAS_bool (true) ;
          }else if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *> (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).ptr ())) {
            GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG cast_2947_instr ((cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG *) constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).ptr ()) ;
            //-------- @assignmentInstructionForGeneration
            outArgument_outFirstInstruction = cast_2947_instr ;
            //-------- @assignmentInstructionForGeneration
            var_found = GALGAS_bool (true) ;
          }else if (constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) {
            GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL cast_3060_instr ((cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) constinArgument_inGeneratedInstructionList.reader_mInstructionAtIndex (var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (71)).ptr ()) ;
            //-------- @assignmentInstructionForGeneration
            outArgument_outFirstInstruction = cast_3060_instr ;
            //-------- @plusEqualnstructionForGeneration
            outArgument_outReachedLabelSet.addAssign_operation (cast_3060_instr.reader_mLabel (SOURCE_FILE_AT_LINE (80)).reader_string (SOURCE_FILE_AT_LINE (80)) COMMA_SOURCE_FILE_AT_LINE (80)) ;
            //-------- @incrementInstructionForGeneration
            var_currentAddress.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (81)) ;
          }else{
            //-------- @incrementInstructionForGeneration
            var_currentAddress.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (83)) ;
          }
        }
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//                      Routine 'performOptimizations'                       *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_performOptimizations (GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                   GALGAS_string & ioArgument_ioListFileContents,
                                   C_Compiler * inCompiler
                                   COMMA_UNUSED_LOCATION_ARGS) {
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (465)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (465)) COMMA_SOURCE_FILE_AT_LINE (465)) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("*").operator_concat (GALGAS_string ("CODE OPTIMIZATION").reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 77U), GALGAS_char (TO_UNICODE (32)) COMMA_SOURCE_FILE_AT_LINE (466)) COMMA_SOURCE_FILE_AT_LINE (466)).operator_concat (GALGAS_string ("*\n") COMMA_SOURCE_FILE_AT_LINE (466)) COMMA_SOURCE_FILE_AT_LINE (466)) ;
  //-------- @concatInstructionForGeneration
  ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string::makeEmptyString ().reader_stringByLeftAndRightPadding (GALGAS_uint ((PMUInt32) 79U), GALGAS_char (TO_UNICODE (42)) COMMA_SOURCE_FILE_AT_LINE (467)).operator_concat (GALGAS_string ("\n"
    "\n") COMMA_SOURCE_FILE_AT_LINE (467)) COMMA_SOURCE_FILE_AT_LINE (467)) ;
  //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
  GALGAS_symbolTableForOptimizations var_symbolTable = GALGAS_symbolTableForOptimizations::constructor_emptyMap (SOURCE_FILE_AT_LINE (469)) ;
  //-------- @foreachInstructionForGeneration
  cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_19778 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
  //--- simple foreach instruction
  GALGAS_uint index_19772 ((PMUInt32) 0) ;
  while (enumerator_19778.hasCurrentObject ()) {
    //-------- @methodCallInstructionForGeneration
    callCategoryMethod_defineLabel ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_19778.current_mInstruction (HERE).ptr (), var_symbolTable, index_19772, inCompiler COMMA_SOURCE_FILE_AT_LINE (471)) ;
    //-------- END @methodCallInstructionForGeneration
    enumerator_19778.gotoNextObject () ;
    index_19772.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (470)) ;
  }
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_optimizationsDone = GALGAS_bool (true) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_uint var_iteration = GALGAS_uint ((PMUInt32) 0U) ;
  //-------- @loopInstructionForGeneration
  if (ioArgument_ioGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (476)).isValid ()) {
    PMUInt32 variant_19993 = ioArgument_ioGeneratedInstructionList.reader_length (SOURCE_FILE_AT_LINE (476)).uintValue () ;
    bool loop_19993 = true ;
    while (loop_19993) {
      loop_19993 = var_optimizationsDone.isValid () ;
      if (loop_19993) {
        loop_19993 = var_optimizationsDone.boolValue () ;
      }
      if (loop_19993 && (0 == variant_19993)) {
        loop_19993 = false ;
        inCompiler->loopRunTimeVariantError (SOURCE_FILE_AT_LINE (476)) ;
      }
      if (loop_19993) {
        variant_19993 -- ;
        //-------- @assignmentInstructionForGeneration
        var_optimizationsDone = GALGAS_bool (false) ;
        //-------- @incrementInstructionForGeneration
        var_iteration.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (480)) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Pass ").operator_concat (var_iteration.reader_string (SOURCE_FILE_AT_LINE (481)) COMMA_SOURCE_FILE_AT_LINE (481)).operator_concat (GALGAS_string (":\n") COMMA_SOURCE_FILE_AT_LINE (481)) COMMA_SOURCE_FILE_AT_LINE (481)) ;
        //-------- @foreachInstructionForGeneration
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_20247 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
        //--- simple foreach instruction
        GALGAS_uint index_20241 ((PMUInt32) 0) ;
        while (enumerator_20247.hasCurrentObject ()) {
          //-------- @structuredCastInstructionForGeneration
          if (enumerator_20247.current_mInstruction (HERE).isValid ()) {
            if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
              GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_20343_pic18_intermediate_JUMP ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeJUMP ((const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) cast_20343_pic18_intermediate_JUMP.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (486)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR) {
              GALGAS_pic_31__38__5F_intermediate_5F_JSR cast_20544_pic18_intermediate_JSR ((cPtr_pic_31__38__5F_intermediate_5F_JSR *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeJSR ((const cPtr_pic_31__38__5F_intermediate_5F_JSR *) cast_20544_pic18_intermediate_JSR.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (488)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) {
              GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation cast_20772_pic18_intermediate_literal ((cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeMOVLW ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation *) cast_20772_pic18_intermediate_literal.ptr (), index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (490)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) {
              GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch cast_20989_pic18_intermediate_cc ((cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeBCC ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) cast_20989_pic18_intermediate_cc.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (492)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) {
              GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register cast_21206_pic18_intermediate_testReg ((cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeTestReg ((const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register *) cast_21206_pic18_intermediate_testReg.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (494)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) {
              GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition cast_21438_pic18_intermediate_decInc ((cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeTestDecInc ((const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) cast_21438_pic18_intermediate_decInc.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (496)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition) {
              GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition cast_21671_pic18_intermediate_CMP ((cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeCMP ((const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) cast_21671_pic18_intermediate_CMP.ptr (), var_symbolTable, index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (498)) ;
              //-------- END @methodCallInstructionForGeneration
            }else if (enumerator_20247.current_mInstruction (HERE).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) {
              GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip cast_21898_pic18_intermediate_bitTestSkip ((cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) enumerator_20247.current_mInstruction (HERE).ptr ()) ;
              //-------- @methodCallInstructionForGeneration
              callCategoryMethod_optimizeBitTestSkip ((const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip *) cast_21898_pic18_intermediate_bitTestSkip.ptr (), index_20241, ioArgument_ioGeneratedInstructionList, ioArgument_ioListFileContents, var_optimizationsDone, inCompiler COMMA_SOURCE_FILE_AT_LINE (500)) ;
              //-------- END @methodCallInstructionForGeneration
            }
          }
          enumerator_20247.gotoNextObject () ;
          index_20241.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (483)) ;
        }
        //-------- @localVariableOrConstantDeclarationWithConstructorCallForGeneration
        GALGAS_stringset var_referencedLabels = GALGAS_stringset::constructor_emptySet (SOURCE_FILE_AT_LINE (505)) ;
        //-------- @foreachInstructionForGeneration
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_22208 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
        //--- simple foreach instruction
        while (enumerator_22208.hasCurrentObject ()) {
          //-------- @methodCallInstructionForGeneration
          callCategoryMethod_enterReferencedLabel ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_22208.current_mInstruction (HERE).ptr (), var_referencedLabels, inCompiler COMMA_SOURCE_FILE_AT_LINE (507)) ;
          //-------- END @methodCallInstructionForGeneration
          enumerator_22208.gotoNextObject () ;
        }
        //-------- @foreachInstructionForGeneration
        cEnumerator_symbolTableForOptimizations enumerator_22316 (var_symbolTable, kEnumeration_up) ;
        //--- simple foreach instruction
        while (enumerator_22316.hasCurrentObject ()) {
          //-------- @ifInstructionForGeneration
          const enumGalgasBool test_0 = var_referencedLabels.reader_hasKey (enumerator_22316.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (510)) COMMA_SOURCE_FILE_AT_LINE (510)).operator_not (SOURCE_FILE_AT_LINE (510)).boolEnum () ;
          if (kBoolTrue == test_0) {
            //-------- @localVariableDeclarationForGeneration
            GALGAS_uint var_definitionLine ;
            //-------- @localVariableDeclarationForGeneration
            GALGAS_bool var_isDeletable ;
            //-------- @methodCallInstructionForGeneration
            var_symbolTable.method_searchKey (enumerator_22316.current_lkey (HERE), var_definitionLine, var_isDeletable, inCompiler COMMA_SOURCE_FILE_AT_LINE (511)) ;
            //-------- END @methodCallInstructionForGeneration
            //-------- @ifInstructionForGeneration
            const enumGalgasBool test_1 = var_isDeletable.boolEnum () ;
            if (kBoolTrue == test_1) {
              //-------- @concatInstructionForGeneration
              ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (var_definitionLine.reader_string (SOURCE_FILE_AT_LINE (513)) COMMA_SOURCE_FILE_AT_LINE (513)).operator_concat (GALGAS_string (": unreferenced label '") COMMA_SOURCE_FILE_AT_LINE (513)).operator_concat (enumerator_22316.current_lkey (HERE).reader_string (SOURCE_FILE_AT_LINE (513)) COMMA_SOURCE_FILE_AT_LINE (513)).operator_concat (GALGAS_string ("' is deleted\n") COMMA_SOURCE_FILE_AT_LINE (513)) COMMA_SOURCE_FILE_AT_LINE (513)) ;
              { //-------- @modifierCallInstructionForGeneration
              ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (514)), var_definitionLine, inCompiler COMMA_SOURCE_FILE_AT_LINE (514)) ;
              } //-------- END @typeMethodInstructionForGeneration
              { //-------- @modifierCallInstructionForGeneration
              GALGAS_uint joker_22766_0 ; // Joker input parameter
              GALGAS_bool joker_22769_0 ; // Joker input parameter
              var_symbolTable.modifier_removeKey (enumerator_22316.current_lkey (HERE), joker_22766_0, joker_22769_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (515)) ;
              } //-------- END @typeMethodInstructionForGeneration
            }
          }
          enumerator_22316.gotoNextObject () ;
        }
        //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
        GALGAS_bool var_reachable = GALGAS_bool (true) ;
        //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
        GALGAS_bool var_skippingInstruction = GALGAS_bool (false) ;
        //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
        GALGAS_bool var_previousWasSkippingInstruction = GALGAS_bool (false) ;
        //-------- @foreachInstructionForGeneration
        cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_23019 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
        //--- simple foreach instruction
        GALGAS_uint index_23013 ((PMUInt32) 0) ;
        while (enumerator_23019.hasCurrentObject ()) {
          //-------- @ifInstructionForGeneration
          const enumGalgasBool test_2 = var_reachable.operator_or (var_previousWasSkippingInstruction COMMA_SOURCE_FILE_AT_LINE (524)).boolEnum () ;
          if (kBoolTrue == test_2) {
            //-------- @assignmentInstructionForGeneration
            var_reachable = callCategoryReader_nextInstructionIsReachable ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23019.current_mInstruction (HERE).ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (525)) ;
            //-------- @assignmentInstructionForGeneration
            var_previousWasSkippingInstruction = var_skippingInstruction ;
            //-------- @assignmentInstructionForGeneration
            var_skippingInstruction = callCategoryReader_isSkippingInstruction ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23019.current_mInstruction (HERE).ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (527)) ;
          }else if (kBoolFalse == test_2) {
            //-------- @localVariableDeclarationForGeneration
            GALGAS_bool var_isLABELorORG ;
            //-------- @methodCallInstructionForGeneration
            callCategoryMethod_isLABELorORG ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23019.current_mInstruction (HERE).ptr (), var_isLABELorORG, inCompiler COMMA_SOURCE_FILE_AT_LINE (529)) ;
            //-------- END @methodCallInstructionForGeneration
            //-------- @localVariableDeclarationForGeneration
            GALGAS_bool var_isNULL ;
            //-------- @methodCallInstructionForGeneration
            callCategoryMethod_isNULL ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_23019.current_mInstruction (HERE).ptr (), var_isNULL, inCompiler COMMA_SOURCE_FILE_AT_LINE (530)) ;
            //-------- END @methodCallInstructionForGeneration
            //-------- @ifInstructionForGeneration
