pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
            const enumGalgasBool test_3 = var_isLABELorORG.operator_not (SOURCE_FILE_AT_LINE (531)).operator_and (var_isNULL.operator_not (SOURCE_FILE_AT_LINE (531)) COMMA_SOURCE_FILE_AT_LINE (531)).boolEnum () ;
            if (kBoolTrue == test_3) {
              //-------- @concatInstructionForGeneration
              ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (index_23013.reader_string (SOURCE_FILE_AT_LINE (532)) COMMA_SOURCE_FILE_AT_LINE (532)).operator_concat (GALGAS_string (": unreachable instruction is deleted\n") COMMA_SOURCE_FILE_AT_LINE (532)) COMMA_SOURCE_FILE_AT_LINE (532)) ;
              { //-------- @modifierCallInstructionForGeneration
              ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (533)), index_23013, inCompiler COMMA_SOURCE_FILE_AT_LINE (533)) ;
              } //-------- END @typeMethodInstructionForGeneration
            }else if (kBoolFalse == test_3) {
              //-------- @ifInstructionForGeneration
              const enumGalgasBool test_4 = var_isLABELorORG.boolEnum () ;
              if (kBoolTrue == test_4) {
                //-------- @assignmentInstructionForGeneration
                var_reachable = GALGAS_bool (true) ;
                //-------- @assignmentInstructionForGeneration
                var_previousWasSkippingInstruction = GALGAS_bool (false) ;
                //-------- @assignmentInstructionForGeneration
                var_skippingInstruction = GALGAS_bool (false) ;
              }
            }
          }
          enumerator_23019.gotoNextObject () ;
          index_23013.increment_operation (inCompiler COMMA_SOURCE_FILE_AT_LINE (523)) ;
        }
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_5 = var_optimizationsDone.operator_not (SOURCE_FILE_AT_LINE (541)).boolEnum () ;
        if (kBoolTrue == test_5) {
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  No optimization\n"
            "\n") COMMA_SOURCE_FILE_AT_LINE (542)) ;
          //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
          GALGAS_uint var_currentAddress = GALGAS_uint ((PMUInt32) 0U) ;
          //-------- @foreachInstructionForGeneration
          cEnumerator_pic_31__38__5F_intermediate_5F_instructionList enumerator_24090 (ioArgument_ioGeneratedInstructionList, kEnumeration_up) ;
          //--- simple foreach instruction
          while (enumerator_24090.hasCurrentObject ()) {
            //-------- @methodCallInstructionForGeneration
            callCategoryMethod_setCurrentAddress ((const cPtr_pic_31__38__5F_intermediate_5F_instruction *) enumerator_24090.current_mInstruction (HERE).ptr (), var_currentAddress, inCompiler COMMA_SOURCE_FILE_AT_LINE (546)) ;
            //-------- END @methodCallInstructionForGeneration
            enumerator_24090.gotoNextObject () ;
          }
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Minimum code size: ").operator_concat (var_currentAddress.reader_string (SOURCE_FILE_AT_LINE (548)) COMMA_SOURCE_FILE_AT_LINE (548)).operator_concat (GALGAS_string (" bytes\n"
            "\n") COMMA_SOURCE_FILE_AT_LINE (548)) COMMA_SOURCE_FILE_AT_LINE (548)) ;
        }
      }
    }
  }
}


//---------------------------------------------------------------------------*
//                                                                           *
//       Category method '@pic18_intermediate_instruction defineLabel'       *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabel> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_defineLabel (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabel inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_defineLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                     GALGAS_symbolTableForOptimizations & io_ioRoutineSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabel f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, io_ioRoutineSymbolTable, constin_inLineIndex, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                   GALGAS_symbolTableForOptimizations & /* ioArgument_ioRoutineSymbolTable */,
                                                                                   const GALGAS_uint /* constinArgument_inLineIndex */,
                                                                                   C_Compiler * /* inCompiler */
                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel (void) {
  enterCategoryMethod_defineLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_defineLabel.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel,
                                                                                   freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_defineLabel) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Overriding category method '@pic18_intermediate_pseudo_LABEL defineLabel' *
//                                                                           *
//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_defineLabel (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                       GALGAS_symbolTableForOptimizations & ioArgument_ioRoutineSymbolTable,
                                                                                       const GALGAS_uint constinArgument_inLineIndex,
                                                                                       C_Compiler * inCompiler
                                                                                       COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL * object = (const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL) ;
  { //-------- @modifierCallInstructionForGeneration
  ioArgument_ioRoutineSymbolTable.modifier_insertKey (object->mAttribute_mLabel, constinArgument_inLineIndex, object->mAttribute_mIsDeletable, inCompiler COMMA_SOURCE_FILE_AT_LINE (22)) ;
  } //-------- END @typeMethodInstructionForGeneration
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_defineLabel (void) {
  enterCategoryMethod_defineLabel (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_defineLabel) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_defineLabel (defineCategoryMethod_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_defineLabel, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//          Category method '@pic18_intermediate_JUMP optimizeJUMP'          *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeJUMP (const PMSInt32 inClassIndex,
                                       categoryMethodSignature_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

