pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
void callCategoryMethod_optimizeJUMP (const cPtr_pic_31__38__5F_intermediate_5F_JUMP * inObject,
                                      const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                      const GALGAS_uint constin_inLineIndex,
                                      GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                      GALGAS_string & io_ioListFileContents,
                                      GALGAS_bool & io_ioOptimizationsDone,
                                      C_Compiler * inCompiler
                                      COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (const cPtr_pic_31__38__5F_intermediate_5F_JUMP * inObject,
                                                                             const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                             const GALGAS_uint constinArgument_inLineIndex,
                                                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                             GALGAS_string & ioArgument_ioListFileContents,
                                                                             GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                             C_Compiler * inCompiler
                                                                             COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_stringset var_reachedLabelSet ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction joker_4062_0 ; // Joker input parameter
  routine_findFirstInstructionOrLabelFromAddress (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (103)), ioArgument_ioGeneratedInstructionList, joker_4062_0, var_reachedLabelSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (103)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = var_reachedLabelSet.reader_hasKey (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (105)) COMMA_SOURCE_FILE_AT_LINE (105)).boolEnum () ;
  if (kBoolTrue == test_0) {
    { //-------- @modifierCallInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (106)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (106)) ;
    } //-------- END @typeMethodInstructionForGeneration
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (107)) COMMA_SOURCE_FILE_AT_LINE (107)).operator_concat (GALGAS_string (": JUMP '") COMMA_SOURCE_FILE_AT_LINE (107)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (107)) COMMA_SOURCE_FILE_AT_LINE (107)).operator_concat (GALGAS_string ("' branching to next instruction deleted\n") COMMA_SOURCE_FILE_AT_LINE (107)) COMMA_SOURCE_FILE_AT_LINE (107)) ;
  }else if (kBoolFalse == test_0) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_uint var_line ;
    //-------- @methodCallInstructionForGeneration
    GALGAS_bool joker_4539_0 ; // Joker input parameter
    constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_4539_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (110)) ;
    //-------- END @methodCallInstructionForGeneration
    //-------- @localVariableDeclarationForGeneration
    GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
    { //-------- @routineCallInstructionForGeneration
    GALGAS_uint joker_4733_0 ; // Joker input parameter
    routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (113)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_4733_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (113)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @structuredCastInstructionForGeneration
    if (var_firstInstruction.isValid ()) {
      if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN) {
        { //-------- @modifierCallInstructionForGeneration
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN::constructor_new (object->mAttribute_mInstructionLocation COMMA_SOURCE_FILE_AT_LINE (118)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (117)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @assignmentInstructionForGeneration
        ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (122)) COMMA_SOURCE_FILE_AT_LINE (122)).operator_concat (GALGAS_string (": JUMP '") COMMA_SOURCE_FILE_AT_LINE (122)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (122)) COMMA_SOURCE_FILE_AT_LINE (122)).operator_concat (GALGAS_string ("' branching to RETURN replaced by RETURN\n") COMMA_SOURCE_FILE_AT_LINE (122)) COMMA_SOURCE_FILE_AT_LINE (122)) ;
      }else if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) {
        GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW cast_5273_retlwInstruction ((cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) var_firstInstruction.ptr ()) ;
        { //-------- @modifierCallInstructionForGeneration
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (cast_5273_retlwInstruction, constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (124)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @assignmentInstructionForGeneration
        ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (129)) COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (GALGAS_string (": JUMP '") COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (129)) COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (GALGAS_string ("'branching to RETLW ") COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (cast_5273_retlwInstruction.reader_mLiteralValue (SOURCE_FILE_AT_LINE (129)).reader_string (SOURCE_FILE_AT_LINE (129)) COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (GALGAS_string ("replaced by RETLW ") COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (cast_5273_retlwInstruction.reader_mLiteralValue (SOURCE_FILE_AT_LINE (129)).reader_string (SOURCE_FILE_AT_LINE (129)) COMMA_SOURCE_FILE_AT_LINE (129)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (129)) COMMA_SOURCE_FILE_AT_LINE (129)) ;
      }else if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
        GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_5686_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) var_firstInstruction.ptr ()) ;
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_1 = GALGAS_bool (kIsNotEqual, object->mAttribute_mTargetLabel.objectCompare (cast_5686_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (131)))).boolEnum () ;
        if (kBoolTrue == test_1) {
          { //-------- @modifierCallInstructionForGeneration
          ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, cast_5686_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (133)), object->mAttribute_mKind COMMA_SOURCE_FILE_AT_LINE (133)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (132)) ;
          } //-------- END @typeMethodInstructionForGeneration
          //-------- @assignmentInstructionForGeneration
          ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (137)) COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (GALGAS_string (": JUMP '") COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (137)) COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (GALGAS_string ("' branching to JUMP '") COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (cast_5686_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (137)).reader_string (SOURCE_FILE_AT_LINE (137)) COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (GALGAS_string ("' replaced by JUMP '") COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (cast_5686_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (137)).reader_string (SOURCE_FILE_AT_LINE (137)) COMMA_SOURCE_FILE_AT_LINE (137)).operator_concat (GALGAS_string ("'\n") COMMA_SOURCE_FILE_AT_LINE (137)) COMMA_SOURCE_FILE_AT_LINE (137)) ;
        }
      }
    }
  }
}
//---------------------------------------------------------------------------*

