pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (void) {
  enterCategoryMethod_optimizeJUMP (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                    categoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP,
                                                                             freeCategoryMethod_pic_31__38__5F_intermediate_5F_JUMP_optimizeJUMP) ;

//---------------------------------------------------------------------------*
//                                                                           *
//           Category method '@pic18_intermediate_JSR optimizeJSR'           *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeJSR (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeJSR (const cPtr_pic_31__38__5F_intermediate_5F_JSR * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (const cPtr_pic_31__38__5F_intermediate_5F_JSR * inObject,
                                                                           const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                           const GALGAS_uint constinArgument_inLineIndex,
                                                                           GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                           GALGAS_string & ioArgument_ioListFileContents,
                                                                           GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                           C_Compiler * inCompiler
                                                                           COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_uint joker_6763_0 ; // Joker input parameter
  routine_findFirstInstructionFromAddress (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (155)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_6763_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (155)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @structuredCastInstructionForGeneration
  if (var_firstInstruction.isValid ()) {
    if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN) {
      { //-------- @modifierCallInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_JUMP::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mTargetLabel, object->mAttribute_mKind COMMA_SOURCE_FILE_AT_LINE (160)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (159)) ;
      } //-------- END @typeMethodInstructionForGeneration
      //-------- @assignmentInstructionForGeneration
      ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (164)) COMMA_SOURCE_FILE_AT_LINE (164)).operator_concat (GALGAS_string (": JSR '") COMMA_SOURCE_FILE_AT_LINE (164)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (164)) COMMA_SOURCE_FILE_AT_LINE (164)).operator_concat (GALGAS_string ("' followed by RETURN replaced by JUMP\n") COMMA_SOURCE_FILE_AT_LINE (164)) COMMA_SOURCE_FILE_AT_LINE (164)) ;
    }else{
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_line ;
      //-------- @methodCallInstructionForGeneration
      GALGAS_bool joker_7361_0 ; // Joker input parameter
      constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_7361_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (167)) ;
      //-------- END @methodCallInstructionForGeneration
      //-------- @localVariableDeclarationForGeneration
      GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstSubroutineInstruction ;
      //-------- @localVariableDeclarationForGeneration
      GALGAS_uint var_followingInstructionLineIndex ;
      { //-------- @routineCallInstructionForGeneration
      routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (172)), ioArgument_ioGeneratedInstructionList, var_firstSubroutineInstruction, var_followingInstructionLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (171)) ;
      } //-------- @routineCallInstructionForGeneration
      //-------- @structuredCastInstructionForGeneration
      if (var_firstSubroutineInstruction.isValid ()) {
        if (var_firstSubroutineInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW) {
          GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW cast_7802_RETLWinstruction ((cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW *) var_firstSubroutineInstruction.ptr ()) ;
          { //-------- @modifierCallInstructionForGeneration
          ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation::constructor_new (object->mAttribute_mInstructionLocation, GALGAS_literal_5F_instruction_5F_opcode::constructor_MOVLW (SOURCE_FILE_AT_LINE (182)), cast_7802_RETLWinstruction.reader_mLiteralValue (SOURCE_FILE_AT_LINE (183)) COMMA_SOURCE_FILE_AT_LINE (180)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (179)) ;
          } //-------- END @typeMethodInstructionForGeneration
          //-------- @assignmentInstructionForGeneration
          ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (188)) COMMA_SOURCE_FILE_AT_LINE (188)).operator_concat (GALGAS_string (": JSR '") COMMA_SOURCE_FILE_AT_LINE (188)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (188)) COMMA_SOURCE_FILE_AT_LINE (188)).operator_concat (GALGAS_string ("' to RETLW ") COMMA_SOURCE_FILE_AT_LINE (189)).operator_concat (cast_7802_RETLWinstruction.reader_mLiteralValue (SOURCE_FILE_AT_LINE (189)).reader_string (SOURCE_FILE_AT_LINE (189)) COMMA_SOURCE_FILE_AT_LINE (189)).operator_concat (GALGAS_string (" replaced by MOVLW ") COMMA_SOURCE_FILE_AT_LINE (190)).operator_concat (cast_7802_RETLWinstruction.reader_mLiteralValue (SOURCE_FILE_AT_LINE (190)).reader_string (SOURCE_FILE_AT_LINE (190)) COMMA_SOURCE_FILE_AT_LINE (190)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (190)) COMMA_SOURCE_FILE_AT_LINE (188)) ;
        }else if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *> (var_firstSubroutineInstruction.ptr ())) {
          GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction cast_8473_actualInstruction ((cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) var_firstSubroutineInstruction.ptr ()) ;
          //-------- @ifInstructionForGeneration
          const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) cast_8473_actualInstruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (192)).objectCompare (GALGAS_uint ((PMUInt32) 2U))).operator_and (callCategoryReader_nextInstructionIsReachable ((const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) cast_8473_actualInstruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (193)) COMMA_SOURCE_FILE_AT_LINE (193)).operator_and (callCategoryReader_isSkippingInstruction ((const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) cast_8473_actualInstruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (194)).operator_not (SOURCE_FILE_AT_LINE (194)) COMMA_SOURCE_FILE_AT_LINE (194)).boolEnum () ;
          if (kBoolTrue == test_0) {
            //-------- @localVariableDeclarationForGeneration
            GALGAS_pic_31__38__5F_intermediate_5F_instruction var_followingInstruction ;
            { //-------- @routineCallInstructionForGeneration
            GALGAS_uint joker_8845_0 ; // Joker input parameter
            routine_findFirstInstructionFromAddress (var_followingInstructionLineIndex, ioArgument_ioGeneratedInstructionList, var_followingInstruction, joker_8845_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (196)) ;
            } //-------- @routineCallInstructionForGeneration
            //-------- @structuredCastInstructionForGeneration
            if (var_followingInstruction.isValid ()) {
              if (var_followingInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN) {
                { //-------- @modifierCallInstructionForGeneration
                ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (cast_8473_actualInstruction, constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (199)) ;
                } //-------- END @typeMethodInstructionForGeneration
                //-------- @assignmentInstructionForGeneration
                ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
                //-------- @concatInstructionForGeneration
                ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (204)) COMMA_SOURCE_FILE_AT_LINE (204)).operator_concat (GALGAS_string (": JSR '") COMMA_SOURCE_FILE_AT_LINE (204)).operator_concat (object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (204)) COMMA_SOURCE_FILE_AT_LINE (204)).operator_concat (GALGAS_string ("' to one instruction routine replaced by instruction\n") COMMA_SOURCE_FILE_AT_LINE (205)) COMMA_SOURCE_FILE_AT_LINE (204)) ;
              }
            }
          }
        }
      }
    }
  }
}
//---------------------------------------------------------------------------*

