pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (void) {
  enterCategoryMethod_optimizeJSR (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR (defineCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR,
                                                                           freeCategoryMethod_pic_31__38__5F_intermediate_5F_JSR_optimizeJSR) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_literalOperation optimizeMOVLW'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeMOVLW (const PMSInt32 inClassIndex,
                                        categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeMOVLW (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                       const GALGAS_uint constin_inLineIndex,
                                       GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                       GALGAS_string & io_ioListFileContents,
                                       GALGAS_bool & io_ioOptimizationsDone,
                                       C_Compiler * inCompiler
                                       COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * inObject,
                                                                                                         const GALGAS_uint constinArgument_inLineIndex,
                                                                                                         GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                         GALGAS_string & ioArgument_ioListFileContents,
                                                                                                         GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation) ;
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = GALGAS_bool (kIsEqual, object->mAttribute_mLiteralInstruction.objectCompare (GALGAS_literal_5F_instruction_5F_opcode::constructor_MOVLW (SOURCE_FILE_AT_LINE (221)))).boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @localVariableDeclarationForGeneration
    GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
    { //-------- @routineCallInstructionForGeneration
    GALGAS_uint joker_9980_0 ; // Joker input parameter
    routine_findFirstInstructionFromAddress (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (224)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_9980_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (224)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @structuredCastInstructionForGeneration
    if (var_firstInstruction.isValid ()) {
      if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETURN) {
        { //-------- @modifierCallInstructionForGeneration
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_RETLW::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mLiteralValue COMMA_SOURCE_FILE_AT_LINE (229)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (228)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @assignmentInstructionForGeneration
        ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (233)) COMMA_SOURCE_FILE_AT_LINE (233)).operator_concat (GALGAS_string (": MOVLW ") COMMA_SOURCE_FILE_AT_LINE (233)).operator_concat (object->mAttribute_mLiteralValue.reader_string (SOURCE_FILE_AT_LINE (233)) COMMA_SOURCE_FILE_AT_LINE (233)).operator_concat (GALGAS_string (" followed by RETURN replaced by RETLW ") COMMA_SOURCE_FILE_AT_LINE (233)).operator_concat (object->mAttribute_mLiteralValue.reader_string (SOURCE_FILE_AT_LINE (233)) COMMA_SOURCE_FILE_AT_LINE (233)).operator_concat (GALGAS_string ("\n") COMMA_SOURCE_FILE_AT_LINE (233)) COMMA_SOURCE_FILE_AT_LINE (233)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (void) {
  enterCategoryMethod_optimizeMOVLW (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation.mSlotID,
                                     categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW.free () ;
}

//---------------------------------------------------------------------------*

