pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW,
                                                                                                         freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_literalOperation_optimizeMOVLW) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_conditionalBranch optimizeBCC'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeBCC (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeBCC (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * inObject,
                                                                                                        const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                        const GALGAS_uint constinArgument_inLineIndex,
                                                                                                        GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                                        GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_line ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bool joker_10984_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_10984_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (249)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_uint joker_11172_0 ; // Joker input parameter
  routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (252)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_11172_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (252)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @structuredCastInstructionForGeneration
  if (var_firstInstruction.isValid ()) {
    if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
      GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_11287_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) var_firstInstruction.ptr ()) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, object->mAttribute_mTargetLabel.reader_string (SOURCE_FILE_AT_LINE (256)).objectCompare (cast_11287_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (256)).reader_string (SOURCE_FILE_AT_LINE (256)))).boolEnum () ;
      if (kBoolTrue == test_0) {
        { //-------- @modifierCallInstructionForGeneration
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mBranchMode, object->mAttribute_mConditionalBranch, cast_11287_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (258)) COMMA_SOURCE_FILE_AT_LINE (258)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (257)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @assignmentInstructionForGeneration
        ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (GALGAS_string (": label of JUMP ") COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (categoryReader_condition (object->mAttribute_mConditionalBranch, inCompiler COMMA_SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (GALGAS_string (" branching to JUMP '") COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (cast_11287_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (262)).reader_string (SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (GALGAS_string ("' replaced by second JUMP '") COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (cast_11287_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (262)).reader_string (SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)).operator_concat (GALGAS_string ("'\n") COMMA_SOURCE_FILE_AT_LINE (262)) COMMA_SOURCE_FILE_AT_LINE (262)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

