pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (void) {
  enterCategoryMethod_optimizeBCC (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC,
                                                                                                        freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_optimizeBCC) ;

//---------------------------------------------------------------------------*
//                                                                           *
// Category method '@pic18_intermediate_jump_test_register optimizeTestReg'  *
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTestReg (const PMSInt32 inClassIndex,
                                          categoryMethodSignature_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeTestReg (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inObject,
                                         const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                         const GALGAS_uint constin_inLineIndex,
                                         GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                         GALGAS_string & io_ioListFileContents,
                                         GALGAS_bool & io_ioOptimizationsDone,
                                         C_Compiler * inCompiler
                                         COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * inObject,
                                                                                                    const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                    const GALGAS_uint constinArgument_inLineIndex,
                                                                                                    GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                    GALGAS_string & ioArgument_ioListFileContents,
                                                                                                    GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                    C_Compiler * inCompiler
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_line ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bool joker_12337_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_12337_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (278)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_uint joker_12525_0 ; // Joker input parameter
  routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (281)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_12525_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (281)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @structuredCastInstructionForGeneration
  if (var_firstInstruction.isValid ()) {
    if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
      GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_12640_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) var_firstInstruction.ptr ()) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_0 = GALGAS_bool (kIsNotEqual, object->mAttribute_mTargetLabel.mAttribute_string.objectCompare (cast_12640_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (285)).reader_string (SOURCE_FILE_AT_LINE (285)))).boolEnum () ;
      if (kBoolTrue == test_0) {
        { //-------- @modifierCallInstructionForGeneration
        ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mRegisterDescription, cast_12640_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (287)), object->mAttribute_mBranchIfZero, object->mAttribute_mUsesBra COMMA_SOURCE_FILE_AT_LINE (287)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (286)) ;
        } //-------- END @typeMethodInstructionForGeneration
        //-------- @assignmentInstructionForGeneration
        ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (291)) COMMA_SOURCE_FILE_AT_LINE (291)).operator_concat (GALGAS_string (": label of JUMP ") COMMA_SOURCE_FILE_AT_LINE (291)).operator_concat (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (291)) COMMA_SOURCE_FILE_AT_LINE (291)) COMMA_SOURCE_FILE_AT_LINE (291)) ;
        //-------- @ifInstructionForGeneration
        const enumGalgasBool test_1 = object->mAttribute_mBranchIfZero.boolEnum () ;
        if (kBoolTrue == test_1) {
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Z") COMMA_SOURCE_FILE_AT_LINE (293)) ;
        }else if (kBoolFalse == test_1) {
          //-------- @concatInstructionForGeneration
          ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("NZ") COMMA_SOURCE_FILE_AT_LINE (295)) ;
        }
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" branching to JUMP replaced by second JUMP label\n") COMMA_SOURCE_FILE_AT_LINE (297)) ;
      }
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (void) {
  enterCategoryMethod_optimizeTestReg (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register.mSlotID,
                                       categoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg (defineCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg,
                                                                                                    freeCategoryMethod_pic_31__38__5F_intermediate_5F_jump_5F_test_5F_register_optimizeTestReg) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_incDecRegisterInCondition optimizeTestDecInc'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeTestDecInc (const PMSInt32 inClassIndex,
                                             categoryMethodSignature_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeTestDecInc (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * inObject,
                                            const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                            const GALGAS_uint constin_inLineIndex,
                                            GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                            GALGAS_string & io_ioListFileContents,
                                            GALGAS_bool & io_ioOptimizationsDone,
                                            C_Compiler * inCompiler
                                            COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

