pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
static void categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * inObject,
                                                                                                        const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                        const GALGAS_uint constinArgument_inLineIndex,
                                                                                                        GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                        GALGAS_string & ioArgument_ioListFileContents,
                                                                                                        GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_line ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bool joker_13811_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_13811_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (313)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_uint joker_13999_0 ; // Joker input parameter
  routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (316)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_13999_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (316)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @structuredCastInstructionForGeneration
  if (var_firstInstruction.isValid ()) {
    if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
      GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_14114_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) var_firstInstruction.ptr ()) ;
      { //-------- @modifierCallInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mRegisterDescription, cast_14114_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (324)), object->mAttribute_mIncrement, object->mAttribute_m_5F_W_5F_isDestination, object->mAttribute_mBranchIfZero, object->mAttribute_mUsesBra COMMA_SOURCE_FILE_AT_LINE (321)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (320)) ;
      } //-------- END @typeMethodInstructionForGeneration
      //-------- @assignmentInstructionForGeneration
      ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (333)) COMMA_SOURCE_FILE_AT_LINE (333)).operator_concat (GALGAS_string (": label of ") COMMA_SOURCE_FILE_AT_LINE (333)) COMMA_SOURCE_FILE_AT_LINE (333)) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ") COMMA_SOURCE_FILE_AT_LINE (334)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_0 = object->mAttribute_mIncrement.boolEnum () ;
      if (kBoolTrue == test_0) {
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("INCF ") COMMA_SOURCE_FILE_AT_LINE (336)) ;
      }else if (kBoolFalse == test_0) {
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("DECF ") COMMA_SOURCE_FILE_AT_LINE (338)) ;
      }
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (340)) COMMA_SOURCE_FILE_AT_LINE (340)) ;
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_1 = object->mAttribute_m_5F_W_5F_isDestination.boolEnum () ;
      if (kBoolTrue == test_1) {
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (", W ") COMMA_SOURCE_FILE_AT_LINE (342)) ;
      }
      //-------- @ifInstructionForGeneration
      const enumGalgasBool test_2 = object->mAttribute_mBranchIfZero.boolEnum () ;
      if (kBoolTrue == test_2) {
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("Z") COMMA_SOURCE_FILE_AT_LINE (345)) ;
      }else if (kBoolFalse == test_2) {
        //-------- @concatInstructionForGeneration
        ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("NZ") COMMA_SOURCE_FILE_AT_LINE (347)) ;
      }
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" branching to JUMP replaced by second JUMP label\n") COMMA_SOURCE_FILE_AT_LINE (349)) ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (void) {
  enterCategoryMethod_optimizeTestDecInc (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                          categoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc (defineCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc,
                                                                                                        freeCategoryMethod_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_optimizeTestDecInc) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_registerComparisonCondition optimizeCMP'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeCMP (const PMSInt32 inClassIndex,
                                      categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

