pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
void callCategoryMethod_optimizeCMP (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                     const GALGAS_symbolTableForOptimizations constin_inSymbolTable,
                                     const GALGAS_uint constin_inLineIndex,
                                     GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                     GALGAS_string & io_ioListFileContents,
                                     GALGAS_bool & io_ioOptimizationsDone,
                                     C_Compiler * inCompiler
                                     COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inSymbolTable, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * inObject,
                                                                                                   const GALGAS_symbolTableForOptimizations constinArgument_inSymbolTable,
                                                                                                   const GALGAS_uint constinArgument_inLineIndex,
                                                                                                   GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                   GALGAS_string & ioArgument_ioListFileContents,
                                                                                                   GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                   C_Compiler * inCompiler
                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  //-------- @localVariableDeclarationForGeneration
  GALGAS_uint var_line ;
  //-------- @methodCallInstructionForGeneration
  GALGAS_bool joker_15537_0 ; // Joker input parameter
  constinArgument_inSymbolTable.method_searchKey (object->mAttribute_mTargetLabel, var_line, joker_15537_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (364)) ;
  //-------- END @methodCallInstructionForGeneration
  //-------- @localVariableDeclarationForGeneration
  GALGAS_pic_31__38__5F_intermediate_5F_instruction var_firstInstruction ;
  { //-------- @routineCallInstructionForGeneration
  GALGAS_uint joker_15725_0 ; // Joker input parameter
  routine_findFirstInstructionFromAddress (var_line.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (367)), ioArgument_ioGeneratedInstructionList, var_firstInstruction, joker_15725_0, inCompiler COMMA_SOURCE_FILE_AT_LINE (367)) ;
  } //-------- @routineCallInstructionForGeneration
  //-------- @structuredCastInstructionForGeneration
  if (var_firstInstruction.isValid ()) {
    if (var_firstInstruction.dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
      GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_15840_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) var_firstInstruction.ptr ()) ;
      { //-------- @modifierCallInstructionForGeneration
      ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mRegisterDescription, cast_15840_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (375)), object->mAttribute_mComparison, object->mAttribute_mUsesBra COMMA_SOURCE_FILE_AT_LINE (372)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (371)) ;
      } //-------- END @typeMethodInstructionForGeneration
      //-------- @assignmentInstructionForGeneration
      ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  line ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (382)) COMMA_SOURCE_FILE_AT_LINE (382)).operator_concat (GALGAS_string (": label of ") COMMA_SOURCE_FILE_AT_LINE (382)) COMMA_SOURCE_FILE_AT_LINE (382)) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("JUMP ") COMMA_SOURCE_FILE_AT_LINE (383)) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (object->mAttribute_mRegisterDescription.reader_mAssemblyString (SOURCE_FILE_AT_LINE (384)) COMMA_SOURCE_FILE_AT_LINE (384)) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" ").operator_concat (categoryReader_mnemonic (object->mAttribute_mComparison, inCompiler COMMA_SOURCE_FILE_AT_LINE (385)) COMMA_SOURCE_FILE_AT_LINE (385)) COMMA_SOURCE_FILE_AT_LINE (385)) ;
      //-------- @concatInstructionForGeneration
      ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" branching to JUMP replaced by second JUMP label\n") COMMA_SOURCE_FILE_AT_LINE (386)) ;
    }
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (void) {
  enterCategoryMethod_optimizeCMP (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                   categoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP) ;
}

//---------------------------------------------------------------------------*

