pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_optimizations.cpp
static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP (defineCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP,
                                                                                                   freeCategoryMethod_pic_31__38__5F_intermediate_5F_registerComparisonCondition_optimizeCMP) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Category method '@pic18_intermediate_instruction_BitTestSkip optimizeBitTestSkip'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip> gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_optimizeBitTestSkip (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip inMethod) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip.forceObjectAtIndex (inClassIndex, inMethod, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

void callCategoryMethod_optimizeBitTestSkip (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                             const GALGAS_uint constin_inLineIndex,
                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                             GALGAS_string & io_ioListFileContents,
                                             GALGAS_bool & io_ioOptimizationsDone,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) {
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip f = NULL ;
    if (classIndex < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip.count ()) {
      f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip.count ()) {
           f = gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY METHOD CALL ERROR", __FILE__, __LINE__) ;
    }else{
      f (inObject, constin_inLineIndex, io_ioGeneratedInstructionList, io_ioListFileContents, io_ioOptimizationsDone, inCompiler COMMA_THERE) ;
    }
  }
}

//---------------------------------------------------------------------------*

static void categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * inObject,
                                                                                                          const GALGAS_uint constinArgument_inLineIndex,
                                                                                                          GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument_ioGeneratedInstructionList,
                                                                                                          GALGAS_string & ioArgument_ioListFileContents,
                                                                                                          GALGAS_bool & ioArgument_ioOptimizationsDone,
                                                                                                          C_Compiler * inCompiler
                                                                                                          COMMA_UNUSED_LOCATION_ARGS) {
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip * object = inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip) ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_string var_jumpLabel = GALGAS_string::makeEmptyString () ;
  //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
  GALGAS_bool var_ok = GALGAS_bool (false) ;
  //-------- @structuredCastInstructionForGeneration
  if (ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)).isValid ()) {
    if (ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)).dynamicTypeDescriptor () == & kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP) {
      GALGAS_pic_31__38__5F_intermediate_5F_JUMP cast_17038_jump ((cPtr_pic_31__38__5F_intermediate_5F_JUMP *) ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)), inCompiler COMMA_SOURCE_FILE_AT_LINE (402)).ptr ()) ;
      //-------- @assignmentInstructionForGeneration
      var_jumpLabel = cast_17038_jump.reader_mTargetLabel (SOURCE_FILE_AT_LINE (404)).reader_string (SOURCE_FILE_AT_LINE (404)) ;
      //-------- @assignmentInstructionForGeneration
      var_ok = GALGAS_bool (true) ;
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_0 = var_ok.boolEnum () ;
  if (kBoolTrue == test_0) {
    //-------- @structuredCastInstructionForGeneration
    if (ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)).isValid ()) {
      if (NULL != dynamic_cast <const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *> (ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)).ptr ())) {
        GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction cast_17318_instruction ((cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)), inCompiler COMMA_SOURCE_FILE_AT_LINE (410)).ptr ()) ;
        //-------- @assignmentInstructionForGeneration
        var_ok = GALGAS_bool (kIsEqual, callCategoryReader_instructionLength ((const cPtr_pic_31__38__5F_intermediate_5F_actualInstruction *) cast_17318_instruction.ptr (), inCompiler COMMA_SOURCE_FILE_AT_LINE (412)).objectCompare (GALGAS_uint ((PMUInt32) 1U))) ;
      }else{
        //-------- @assignmentInstructionForGeneration
        var_ok = GALGAS_bool (false) ;
      }
    }
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_1 = var_ok.boolEnum () ;
  if (kBoolTrue == test_1) {
    //-------- @localVariableOrConstantDeclarationWithSourceExpressionForGeneration
    GALGAS_pic_31__38__5F_intermediate_5F_instruction var_thirdInstruction = GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (419)) ;
    //-------- @localVariableDeclarationForGeneration
    GALGAS_stringset var_reachedLabelSet ;
    { //-------- @routineCallInstructionForGeneration
    GALGAS_pic_31__38__5F_intermediate_5F_instruction joker_17690_0 ; // Joker input parameter
    routine_findFirstInstructionOrLabelFromAddress (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 3U), inCompiler COMMA_SOURCE_FILE_AT_LINE (421)), ioArgument_ioGeneratedInstructionList, joker_17690_0, var_reachedLabelSet, inCompiler COMMA_SOURCE_FILE_AT_LINE (421)) ;
    } //-------- @routineCallInstructionForGeneration
    //-------- @assignmentInstructionForGeneration
    var_ok = var_reachedLabelSet.reader_hasKey (var_jumpLabel COMMA_SOURCE_FILE_AT_LINE (422)) ;
  }
  //-------- @ifInstructionForGeneration
  const enumGalgasBool test_2 = var_ok.boolEnum () ;
  if (kBoolTrue == test_2) {
    { //-------- @modifierCallInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip::constructor_new (object->mAttribute_mInstructionLocation, object->mAttribute_mSkipIfSet.operator_not (SOURCE_FILE_AT_LINE (430)), object->mAttribute_mRegisterDescription, object->mAttribute_mBitNumber COMMA_SOURCE_FILE_AT_LINE (428)), constinArgument_inLineIndex, inCompiler COMMA_SOURCE_FILE_AT_LINE (427)) ;
    } //-------- END @typeMethodInstructionForGeneration
    { //-------- @modifierCallInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (ioArgument_ioGeneratedInstructionList.reader_mInstructionAtIndex (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (438)), inCompiler COMMA_SOURCE_FILE_AT_LINE (438)), constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 1U), inCompiler COMMA_SOURCE_FILE_AT_LINE (439)), inCompiler COMMA_SOURCE_FILE_AT_LINE (437)) ;
    } //-------- END @typeMethodInstructionForGeneration
    { //-------- @modifierCallInstructionForGeneration
    ioArgument_ioGeneratedInstructionList.modifier_setMInstructionAtIndex (GALGAS_pic_31__38__5F_intermediate_5F_NULL::constructor_new (SOURCE_FILE_AT_LINE (443)), constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (444)), inCompiler COMMA_SOURCE_FILE_AT_LINE (442)) ;
    } //-------- END @typeMethodInstructionForGeneration
    //-------- @assignmentInstructionForGeneration
    ioArgument_ioOptimizationsDone = GALGAS_bool (true) ;
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string ("  lines ").operator_concat (constinArgument_inLineIndex.reader_string (SOURCE_FILE_AT_LINE (449)) COMMA_SOURCE_FILE_AT_LINE (449)).operator_concat (GALGAS_string (" to ") COMMA_SOURCE_FILE_AT_LINE (449)).operator_concat (constinArgument_inLineIndex.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (449)).reader_string (SOURCE_FILE_AT_LINE (449)) COMMA_SOURCE_FILE_AT_LINE (449)) COMMA_SOURCE_FILE_AT_LINE (449)) ;
    //-------- @concatInstructionForGeneration
    ioArgument_ioListFileContents.dotAssign_operation (GALGAS_string (" bit test skip, following by a JUMP skipping next instruction, is complemented\n") COMMA_SOURCE_FILE_AT_LINE (450)) ;
  }
}
//---------------------------------------------------------------------------*

static void defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (void) {
  enterCategoryMethod_optimizeBitTestSkip (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip.mSlotID,
                                           categoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (void) {
  gCategoryMethodTable_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip (defineCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip,
                                                                                                          freeCategoryMethod_pic_31__38__5F_intermediate_5F_instruction_5F_BitTestSkip_optimizeBitTestSkip) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


